<img src="">

### DATA COLLECTION

In [285]:
import pandas as pd
df=pd.read_csv("titanic_train.csv")

### DATA EXPLORATION & FEATURE ENGG

In [286]:
df.shape

(891, 12)

In [287]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [288]:
#passenger id and name column are not reqd to predict Survived 
df.drop(["PassengerId","Name","Ticket","Cabin"],axis=1,inplace=True)

In [289]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [290]:
df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [291]:
#replacing the missing values of Age by median of age column
df["Age_cleaned"]=df["Age"].fillna(med)

In [292]:
#dropping our old age column
df.drop(["Age"],axis=1,inplace=True)

In [293]:
df.head()

   Survived  Pclass     Sex  SibSp  Parch     Fare Embarked  Age_cleaned
0         0       3    male      1      0   7.2500        S         22.0
1         1       1  female      1      0  71.2833        C         38.0
2         1       3  female      0      0   7.9250        S         26.0
3         1       1  female      1      0  53.1000        S         35.0
4         0       3    male      0      0   8.0500        S         35.0

In [294]:
df.isnull().mean()

Survived       0.000000
Pclass         0.000000
Sex            0.000000
SibSp          0.000000
Parch          0.000000
Fare           0.000000
Embarked       0.002245
Age_cleaned    0.000000
dtype: float64

In [295]:
df.head()

   Survived  Pclass     Sex  SibSp  Parch     Fare Embarked  Age_cleaned
0         0       3    male      1      0   7.2500        S         22.0
1         1       1  female      1      0  71.2833        C         38.0
2         1       3  female      0      0   7.9250        S         26.0
3         1       1  female      1      0  53.1000        S         35.0
4         0       3    male      0      0   8.0500        S         35.0

In [296]:
#dropping remaining nan values
df.dropna(inplace=True)

In [297]:
df.isnull().sum()

Survived       0
Pclass         0
Sex            0
SibSp          0
Parch          0
Fare           0
Embarked       0
Age_cleaned    0
dtype: int64

In [298]:
df.head()

   Survived  Pclass     Sex  SibSp  Parch     Fare Embarked  Age_cleaned
0         0       3    male      1      0   7.2500        S         22.0
1         1       1  female      1      0  71.2833        C         38.0
2         1       3  female      0      0   7.9250        S         26.0
3         1       1  female      1      0  53.1000        S         35.0
4         0       3    male      0      0   8.0500        S         35.0

Finally got our cleaned data set with clean value.

In [299]:
#applying one hot encoding to convert the categorical features to integers
df=pd.get_dummies(df,columns=["Sex","Embarked"],drop_first=True)

In [300]:
df.head()

,Survived,Pclass,SibSp,Parch,Fare,Age_cleaned,Sex_male,Embarked_Q,Embarked_S
0,0,3,1,0,7.2500,22.0,1,0,1
1,1,1,1,0,71.2833,38.0,0,0,0
2,1,3,0,0,7.9250,26.0,0,0,1
3,1,1,1,0,53.1000,35.0,0,0,1
4,0,3,0,0,8.0500,35.0,1,0,1

In [301]:
#we will now normalize the features to obtain them under the same scale.
from sklearn.preprocessing import StandardScaler
ss=StandardScaler()
df1=pd.DataFrame(ss.fit_transform(df),columns=df.columns)
df1.head()

,Survived,Pclass,SibSp,Parch,Fare,Age_cleaned,Sex_male,Embarked_Q,Embarked_S
0,-0.786961,0.825209,0.431350,-0.474326,-0.500240,-0.563674,0.735342,-0.307941,0.616794
1,1.270711,-1.572211,0.431350,-0.474326,0.788947,0.669217,-1.359911,-0.307941,-1.621287
2,1.270711,0.825209,-0.475199,-0.474326,-0.486650,-0.255451,-1.359911,-0.307941,0.616794
3,1.270711,-1.572211,0.431350,-0.474326,0.422861,0.438050,-1.359911,-0.307941,0.616794
4,-0.786961,0.825209,-0.475199,-0.474326,-0.484133,0.438050,0.735342,-0.307941,0.616794

Our data is ready for putting in ml model.

### MODEL BUILDING

In [303]:
X=df.drop("Survived",axis=1)
y=df["Survived"]

In [304]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.3,random_state=0)

In [313]:
from sklearn.linear_model import LogisticRegression
mod=LogisticRegression(n_jobs=-1)
mod.fit(X_train,y_train)

LogisticRegression(n_jobs=-1)

In [314]:
y_pred=mod.predict(X_test)

In [316]:
from sklearn.metrics import confusion_matrix,classification_report,accuracy_score
print(confusion_matrix(y_test,y_pred))
print(classification_report(y_test,y_pred))
print(accuracy_score(y_test,y_pred))

[[132  25]
 [ 35  75]]
              precision    recall  f1-score   support

           0       0.79      0.84      0.81       157
           1       0.75      0.68      0.71       110

    accuracy                           0.78       267
   macro avg       0.77      0.76      0.76       267
weighted avg       0.77      0.78      0.77       267

0.7752808988764045